// 1/11/24
// Today I начинаю учить 7е В. из курса Димыча
// НО
// начинаю учить САМОСТОЯТЕЛЬНО
// ---- Для Этого -- я попытаюсь По Памяти
// -- написать Всю Про.-у из 6го урока Целиком --- сколько смогу. ...... Поехали!!!!
// Сегодня начал писать ПСЕВДОКОД для этой моей/Димыча Про.-ы..... - Закончить НЕ успел....

//
//
//
11/01/24

Разделить Про.-у на ДВЕ Части

создать  I. B. - для ввода и Инициализации П.-х --- для Д.-х

создать три Блока с 2мя const-П.-ми в Каждом Блоке -- рус., англ. слово

создать C. B. -- в котором будет производиться вся Работа и Опе.-и с Д.-ми


1. Показывать Русское слово и принимать ответ от Изучающего (По.-я Про.-ы)
  Создать П.-ю    для последующего присвоения З.-я prompt(рус. слово, "Введите слово на Английском")
   Ввдённое Ю.-м З. присвоить П.-й

2. Сравнивать ответ Ю.-а с ответом из (скрытых) Д.-х Про.-ы


  Создать Ветвление в Про.-е - Вилку/Развилку:

3.1 Если ответ Ю.-а совпадает с записанным в Про.-е/с Правильным --  показывать true и            
 Прибавлять к Каждому такому ответу 1

создать let Variable numberOfCorrectAnswers с Перовночальным З.-м = 0


3.2 Если ответ НЕ совпадает/НЕправильный -- показывать false
и
Показывать в диалоговом окне Правильный вариант

4. После Показа/Проверки - Изучения Всех слов:
  выдавать Сообщения  --  Great - если Правильных ответов Больше 50%
    и Well done! But try harder! -- если Правильных ответов Меньше 50%

5. Показывать сообщением - Результат Правильных ответов в %

6. Показывать сообщением Количество /цифрой/ правильных ответов



//



//
